tests/jmeter/jmeter.log
2025-10-21 02:41:52,074 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-10-21 02:41:52,209 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2025-10-21 02:41:52,213 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2025-10-21 02:41:52,215 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2025-10-21 02:41:52,273 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2025-10-21 02:41:52,274 INFO o.a.j.JMeter: Version 5.5
2025-10-21 02:41:52,274 INFO o.a.j.JMeter: java.version=1.8.0_275
2025-10-21 02:41:52,280 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-10-21 02:41:52,280 INFO o.a.j.JMeter: os.name=Linux
2025-10-21 02:41:52,281 INFO o.a.j.JMeter: os.arch=amd64
2025-10-21 02:41:52,281 INFO o.a.j.JMeter: os.version=6.6.87.2-microsoft-standard-WSL2
2025-10-21 02:41:52,281 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-10-21 02:41:52,282 INFO o.a.j.JMeter: java.awt.headless=true
2025-10-21 02:41:52,282 INFO o.a.j.JMeter: Max memory     =5309988864
2025-10-21 02:41:52,283 INFO o.a.j.JMeter: Available Processors =10
2025-10-21 02:41:52,320 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-10-21 02:41:52,323 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-10-21 02:41:52,323 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2025-10-21 02:41:52,324 INFO o.a.j.JMeter: user.dir  =/test
2025-10-21 02:41:52,325 INFO o.a.j.JMeter: PWD       =/test
2025-10-21 02:41:52,327 INFO o.a.j.JMeter: IP: 172.17.0.4 Name: a89035e2238d FullName: a89035e2238d
2025-10-21 02:41:52,526 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/test/report'
2025-10-21 02:41:52,547 INFO o.a.j.s.FileServer: Default base='/test'
2025-10-21 02:41:52,555 INFO o.a.j.s.FileServer: Set new base='/test'
2025-10-21 02:41:53,531 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-10-21 02:41:53,841 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-10-21 02:41:53,880 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-10-21 02:41:53,926 INFO o.a.j.s.SaveService: Loading file: tabs_smoke.jmx
2025-10-21 02:41:54,327 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-21 02:41:54,328 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-21 02:41:54,329 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-21 02:41:54,329 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-21 02:41:54,330 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-10-21 02:41:54,330 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-10-21 02:41:56,655 INFO o.a.j.JMeter: Creating summariser <summary>
2025-10-21 02:41:56,826 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2025-10-21 02:41:56,830 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: results.jtl
2025-10-21 02:41:56,831 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.5/bin/reportgenerator.properties
2025-10-21 02:41:56,841 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2025-10-21 02:41:56,884 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2025-10-21 02:41:56,928 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2025-10-21 02:41:56,929 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2025-10-21 02:41:56,930 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2025-10-21 02:41:56,930 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2025-10-21 02:41:56,930 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2025-10-21 02:41:56,931 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2025-10-21 02:41:56,931 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2025-10-21 02:41:56,934 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2025-10-21 02:41:56,987 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,989 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,990 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,991 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,991 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,992 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,993 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,994 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,995 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:56,996 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-21 02:41:57,004 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2025-10-21 02:41:57,005 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2025-10-21 02:41:57,005 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2025-10-21 02:41:57,010 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2025-10-21 02:41:57,011 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2025-10-21 02:41:57,011 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2025-10-21 02:41:57,153 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-10-21 02:41:57,185 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-21 02:41:57,187 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-21 02:41:57,230 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-10-21 02:41:57,231 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-10-21 02:41:59,895 INFO o.a.j.JMeter: Running test (1761007319895)
2025-10-21 02:42:00,449 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Smoke users
2025-10-21 02:42:00,456 INFO o.a.j.e.StandardJMeterEngine: Starting 3 threads for group Smoke users.
2025-10-21 02:42:00,458 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-10-21 02:42:00,463 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=3 ramp-up=1 delayedStart=false
2025-10-21 02:42:00,535 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-10-21 02:42:00,536 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-10-21 02:42:00,554 INFO o.a.j.t.JMeterThread: Thread started: Smoke users 1-1
2025-10-21 02:42:00,747 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = a89035e2238d
2025-10-21 02:42:00,800 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-10-21 02:42:00,815 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-10-21 02:42:00,816 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-10-21 02:42:00,817 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-10-21 02:42:00,818 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-10-21 02:42:00,830 INFO o.a.j.t.JMeterThread: Thread started: Smoke users 1-2
2025-10-21 02:42:01,157 INFO o.a.j.t.JMeterThread: Thread started: Smoke users 1-3
2025-10-21 02:42:01,757 INFO o.a.j.r.Summariser: summary +      1 in 00:00:02 =    0.5/s Avg:   213 Min:   213 Max:   213 Err:     1 (100.00%) Active: 3 Started: 3 Finished: 0
2025-10-21 02:42:01,844 INFO o.a.j.t.JMeterThread: Thread is done: Smoke users 1-1
2025-10-21 02:42:01,844 INFO o.a.j.t.JMeterThread: Thread is done: Smoke users 1-2
2025-10-21 02:42:01,844 INFO o.a.j.t.JMeterThread: Thread is done: Smoke users 1-3
2025-10-21 02:42:01,846 INFO o.a.j.t.JMeterThread: Thread finished: Smoke users 1-1
2025-10-21 02:42:01,846 INFO o.a.j.t.JMeterThread: Thread finished: Smoke users 1-2
2025-10-21 02:42:01,847 INFO o.a.j.t.JMeterThread: Thread finished: Smoke users 1-3
2025-10-21 02:42:01,871 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-10-21 02:42:01,881 INFO o.a.j.r.Summariser: summary +     11 in 00:00:00 =   79.1/s Avg:    55 Min:     3 Max:   213 Err:    11 (100.00%) Active: 0 Started: 3 Finished: 3
2025-10-21 02:42:01,885 INFO o.a.j.r.Summariser: summary =     12 in 00:00:02 =    6.0/s Avg:    68 Min:     3 Max:   213 Err:    12 (100.00%)
2025-10-21 02:42:01,892 INFO o.a.j.JMeter: Generating Dashboard
2025-10-21 02:42:01,895 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2025-10-21 02:42:01,951 WARN o.a.j.s.CSVSaveService: Unknown column name 1761007321460
2025-10-21 02:42:01,963 WARN o.a.j.r.c.CsvSampleReader: File '/test/results.jtl' does not contain the field names header, ensure the jmeter.save.saveservice.* properties are the same as when the CSV file was created or the file may be read incorrectly when generating report
2025-10-21 02:42:01,988 WARN o.a.j.r.c.CsvSampleReader: Short CSV read around line 2 of file 'results.jtl'. Could only read 12 elements of 17 expected. Data is [1761007321459, 213, GET /, Non HTTP response code: org.apache.http.conn.HttpHostConnectException, false, 2673, 0, 3, 3, 0, 0, 211]
2025-10-21 02:42:01,990 ERROR o.a.j.JMeter: Error generating the report: Mismatch between expected number of columns:17 and columns in CSV file:12, check your jmeter.save.saveservice.* configuration or check if line 2 in 'results.jtl' is complete
org.apache.jmeter.report.core.SampleException: Mismatch between expected number of columns:17 and columns in CSV file:12, check your jmeter.save.saveservice.* configuration or check if line 2 in 'results.jtl' is complete
	at org.apache.jmeter.report.core.CsvSampleReader.assertCorrectColumns(CsvSampleReader.java:205) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.core.CsvSampleReader.nextSample(CsvSampleReader.java:189) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.core.CsvSampleReader.<init>(CsvSampleReader.java:135) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.core.CsvSampleReader.<init>(CsvSampleReader.java:87) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.processor.CsvFileSampleSource.<init>(CsvFileSampleSource.java:111) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.report.dashboard.ReportGenerator.generate(ReportGenerator.java:209) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter$ListenToTest.endTest(JMeter.java:1264) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.JMeter$ListenToTest.testEnded(JMeter.java:1219) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.engine.StandardJMeterEngine.notifyTestListenersOfEnd(StandardJMeterEngine.java:230) ~[ApacheJMeter_core.jar:5.5]
	at org.apache.jmeter.engine.StandardJMeterEngine.run(StandardJMeterEngine.java:507) ~[ApacheJMeter_core.jar:5.5]
	at java.lang.Thread.run(Thread.java:748) ~[?:1.8.0_275]